/*
Палиндромом называется число, которое читается одинаково слева направо и справа налево. Например: 121, 4 и 123321 — палиндромы, а 12, 2312 и 123 — нет.

Выведите на экран наименьшее натуральное число, которое содержит в десятичной записи все цифры от 0 до 9, делится на 9 и является палиндромом.

Запись числа не должна содержать ведущих нулей. Например, запись 01 содержит ведущие нули, а 1 — нет.

*/

#include <iostream>

using namespace std;
int main()
{
    cout << 1023456789876543201 << endl;
    return 0;
}
