/*
Напишите программу, которая будет выводить на экран строку

2 + 2 = 4

Знаки + и = необходимо отделить пробелом. Цифру 2 использовать в коде программы запрещено.

Примеры
Ввод
Вывод
2 + 2 = 4
*/

#include <iostream>

using namespace std;
int main()
{
    cout << 8 / 4 << " " << "+" << " " << 6 / 3 << " " << "=" << " " << 16 / 4 << endl;
    return 0;
}
