/*
Напишите программу, которая выводит на экран текст

Hello, World!

Обратите внимание на регистр и знаки препинания.

*/

#include <iostream>

int main() {
  std::cout << "Hello, World!";
  return 0;
  }
