/*
Напишите программу, которая выводит на экран трёх различных уточек с помощью символов псевдографики:

  _      _      _
>(.)__ <(.)__ =(.)__
 (___/  (___/  (___/ 


*/

#include <iostream>

using namespace std;
int main()
{
    cout << "  _      _      _" << endl;
    cout << ">(.)__ <(.)__ =(.)__" << endl;
    cout << " (___/  (___/  (___/"  << endl;
    return 0;
}
