/*
Факториал натурального числа n определяется как произведение всех натуральных чисел от 1 до n включительно и обозначается n!:
n!=1⋅2⋅3⋅…⋅n
Например, 3!=1⋅2⋅3=6.

Напишите программу, которая выводит на экран значение 10! (10 факториал).

*/

#include <iostream>

using namespace std;
int main()
{
    cout << 1 * 2 * 3 * 4 * 5 * 6 * 7 * 8 * 9 * 10 << endl;
    return 0;
}
